api_pjbl2/app/Models/data_guruModel.php

SELECT *
FROM `data_guru`
WHERE `nama` LIKE '%%' ESCAPE '!'
---
    public function search($searchTerm)
    {
        // Lakukan logika pencarian data di sini
        // if (!$searchTerm) {
        //     return []; // Kembalikan array kosong jika $searchTerm tidak ada
        // }

        // Contoh: Mencari data guru berdasarkan nama
        $builder = $this->table($this->table);
        $builder->like('nama', $searchTerm);
        $results = $builder->get()->getResult();